bobecek79/SmartESC_STM32_v2/common_files/src/conf_general.c
	HAL_FLASH_Unlock();

	is_ok = conf_general_write_flash(CONF_PAGE, (uint8_t*)conf, sizeof(mc_configuration));

	vTaskDelay(500);
	MCI_ExecTorqueRamp(pMCI[M1], 0, 0);
	VescToSTM_start_motor();

	return is_ok;
}

mc_configuration* mc_interface_get_configuration(void){
	return &mc_conf;
}

void conf_general_mcconf_hw_limits(mc_configuration *mcconf) {
	utils_truncate_number(&mcconf->l_current_max_scale, 0.0, 1.0);
	utils_truncate_number(&mcconf->l_current_min_scale, 0.0, 1.0);

	if(mcconf->override_limits == true) return;
	// This limit should always be active, as starving the threads never
	// makes sense.

#ifndef DISABLE_HW_LIMITS
#ifdef HW_LIM_CURRENT
	utils_truncate_number(&mcconf->l_current_max, HW_LIM_CURRENT);
	utils_truncate_number(&mcconf->l_current_min, HW_LIM_CURRENT);
#endif
#ifdef HW_LIM_CURRENT_IN
	utils_truncate_number(&mcconf->l_in_current_max, HW_LIM_CURRENT_IN);
	utils_truncate_number(&mcconf->l_in_current_min, HW_LIM_CURRENT);
#endif
#ifdef HW_LIM_CURRENT_ABS
	utils_truncate_number(&mcconf->l_abs_current_max, HW_LIM_CURRENT_ABS);
#endif
#ifdef HW_LIM_VIN
	utils_truncate_number(&mcconf->l_max_vin, HW_LIM_VIN);
	utils_truncate_number(&mcconf->l_min_vin, HW_LIM_VIN);
#endif
#ifdef HW_LIM_ERPM
	utils_truncate_number(&mcconf->l_max_erpm, HW_LIM_ERPM);
	utils_truncate_number(&mcconf->l_min_erpm, HW_LIM_ERPM);
#endif
#ifdef HW_LIM_DUTY_MIN
	utils_truncate_number(&mcconf->l_min_duty, HW_LIM_DUTY_MIN);
#endif
#ifdef HW_LIM_DUTY_MAX
	utils_truncate_number(&mcconf->l_max_duty, HW_LIM_DUTY_MAX);
#endif
#ifdef HW_LIM_TEMP_FET
	utils_truncate_number(&mcconf->l_temp_fet_start, HW_LIM_TEMP_FET);
	utils_truncate_number(&mcconf->l_temp_fet_end, HW_LIM_TEMP_FET);
#endif
#ifdef HW_LIM_F_SW
	utils_truncate_number(&mcconf->foc_f_sw, HW_LIM_F_SW);
#endif

#endif
}




void conf_general_setup_f_sw(uint32_t f_sw){

	uint32_t regulation_exec_rate = (f_sw > 20000) ? 2 : 1;

	uint16_t pwm_p_cycles = (uint16_t)((MOT_TMR_MHZ*(uint32_t)1000000u/((uint32_t)(f_sw)))&0xFFFE);

	PWM_Handle_M1._Super.hT_Sqrt3 	 = (pwm_p_cycles*SQRT3FACTOR)/16384u;
	PWM_Handle_M1._Super.PWMperiod   = pwm_p_cycles;
	PWM_Handle_M1.Half_PWMPeriod = pwm_p_cycles/2;
	HALL_M1._Super.hMeasurementFrequency = (uint16_t) ((uint32_t)(f_sw)/(regulation_exec_rate*PWM_FREQ_SCALING));
	RampExtMngrHFParamsM1.FrequencyHz = (uint32_t) ((uint32_t)(f_sw)/(regulation_exec_rate));
	R3_2_ParamsM1.RepetitionCounter = (uint16_t) ((regulation_exec_rate *2u)-1u);
	htim1.Init.Period = ((pwm_p_cycles) / 2);
	htim1.Init.RepetitionCounter = (uint16_t) ((regulation_exec_rate *2u)-1u);
	HAL_TIM_Base_Init(&htim1);
	HAL_TIM_PWM_Init(&htim1);
	TIM_OC_InitTypeDef sConfigOC = {0};

	sConfigOC.OCMode = TIM_OCMODE_PWM1;
	sConfigOC.Pulse = 0;
	sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
	sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
	sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
	sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
	sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
	if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1) != HAL_OK)
	{
	Error_Handler();
	}
	if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_2) != HAL_OK)
	{
	Error_Handler();
	}
	if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_3) != HAL_OK)
	{
	Error_Handler();
	}
	sConfigOC.OCMode = TIM_OCMODE_PWM2;
	sConfigOC.Pulse = (((pwm_p_cycles) / 2) - (HTMIN));
	if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_4) != HAL_OK)
	{
	Error_Handler();
	};
}

void conf_general_setup_mc(mc_configuration *mcconf) {

	conf_general_setup_f_sw(mcconf->foc_f_sw);

	float current_max = mcconf->l_current_max * CURRENT_FACTOR_A * mcconf->l_current_max_scale;
	float current_min = mcconf->l_current_min * CURRENT_FACTOR_A * mcconf->l_current_min_scale;
	mcconf->lo_current_max_scale = 1.0;
	uint16_t max_app_speed;

	if(mcconf->foc_motor_flux_linkage==0){
		VescToSTM_set_minimum_current(0);  //PWM always ON
	}else{
		VescToSTM_set_minimum_current(mcconf->cc_min_current);
	}

	PWM_Handle_M1._Super.OverCurrent = mcconf->l_abs_current_max * CURRENT_FACTOR_A;

	if(mcconf->l_slow_abs_current){
		PWM_Handle_M1._Super.OverCurrentCycles = utils_map(mcconf->foc_current_filter_const,1,0,0,ABS_OVR_CURRENT_TRIP_MS) / (1000.0 / mcconf->foc_f_sw);
	}else{
		PWM_Handle_M1._Super.OverCurrentCycles = 0;  //instant trip
	}

	FOCVars[M1].max_i_batt = mcconf->l_in_current_max * CURRENT_FACTOR_A;
	FOCVars[M1].min_i_batt = mcconf->l_in_current_min * CURRENT_FACTOR_A;

	mcconf->lo_max_erpm = mcconf->l_max_erpm * mcconf->l_erpm_start;
	mcconf->lo_min_erpm = mcconf->l_min_erpm * mcconf->l_erpm_start;

	mcconf->lo_current_min = mcconf->l_current_min;
	mcconf->lo_current_max = mcconf->l_current_max;

	if(mcconf->l_max_erpm >= abs(mcconf->l_min_erpm)){
		max_app_speed = VescToSTM_erpm_to_speed(mcconf->l_max_erpm * 1.15);
	}else{
		max_app_speed = VescToSTM_erpm_to_speed(abs(mcconf->l_min_erpm * 1.15));
	}

	PIDSpeedHandle_M1.hKpGain             = mcconf->s_pid_kp * (float)SP_KPDIV;
	PIDSpeedHandle_M1.hKiGain         	  = mcconf->s_pid_ki * (float)SP_KIDIV / (float)SPEED_LOOP_FREQUENCY_HZ;
	PIDSpeedHandle_M1.wUpperIntegralLimit = current_max * SP_KIDIV;
	PIDSpeedHandle_M1.wLowerIntegralLimit = current_min * SP_KIDIV;
	PIDSpeedHandle_M1.hUpperOutputLimit   = current_max;
	PIDSpeedHandle_M1.hLowerOutputLimit   = current_min;
	PIDSpeedHandle_M1.hDefKpGain 		  = PIDSpeedHandle_M1.hKpGain;
	PIDSpeedHandle_M1.hDefKiGain 		  = PIDSpeedHandle_M1.hKiGain;

	/* VESC detection produces foc_current_kp/ki in SI units - kp = L*bw [V/A],
	 * ki = R*bw [V/(A*s)], see conf_general_calc_apply_foc_cc_kp_ki_gain() - but
	 * the ST current PI runs entirely in ADC counts: s16 current in, s16 voltage
	 * out. The two domains relate as
	 *
	 *   i_counts = i_A * CURRENT_FACTOR_A
	 *   v_counts = v_V * 65536 / Vbus            (32767 <-> Vbus/2, same s16
	 *                                             voltage scale the feed-forward
	 *                                             constants above are built on)
	 *
	 *   kp_counts = kp_V_per_A * 65536 / (Vbus * CURRENT_FACTOR_A)
	 *
	 * That factor was missing: the SI number was loaded straight into the loop,
	 * so with this board's CURRENT_FACTOR_A the current PI ran about 7.6x
	 * under-gained - a ~6.5 ms current-loop time constant where the detection
	 * routine designed 1.0 ms. Kp and Ki were under by the same factor, so the
	 * loop stayed correctly damped; it was slow, not marginal.
	 *
	 * Vbus is not known at config time and swings from 63 V charged to about
	 * 45 V empty, so the scale is fixed at NOMINAL_BUS_VOLTAGE_V. Residual error
	 * is +-17% of gain across that range: bandwidth ~857 rad/s at 63 V and
	 * ~1200 rad/s at 45 V, both far below the 16 kHz switching frequency. */
	#define FOC_CC_GAIN_SCALE (65536.0f / ((float)NOMINAL_BUS_VOLTAGE_V * (float)CURRENT_FACTOR_A))

