bobecek79/SmartESC_STM32_v2/common_files/src/conf_general.c
	/* hKpGain/hKiGain are int16_t. The detected values land near 1280 and 630
	 * here, but clamp rather than let a large configured gain wrap to a negative
	 * one - a negative gain is positive feedback in the current loop. */
	float cc_kp = mcconf->foc_current_kp * FOC_CC_GAIN_SCALE * (float)TF_KPDIV;
	float cc_ki = mcconf->foc_current_ki * FOC_CC_GAIN_SCALE * (float)TF_KIDIV / (float)mcconf->foc_f_sw;
	utils_truncate_number(&cc_kp, 0.0f, (float)INT16_MAX);
	utils_truncate_number(&cc_ki, 0.0f, (float)INT16_MAX);

	PIDIqHandle_M1.hKpGain          	  = cc_kp;
	PIDIqHandle_M1.hKiGain                = cc_ki;
	PIDIqHandle_M1.hDefKpGain 			  = PIDIqHandle_M1.hKpGain;
	PIDIqHandle_M1.hDefKiGain 			  = PIDIqHandle_M1.hKiGain;
	PIDIqHandle_M1.hUpperOutputLimit	  = INT16_MAX * mcconf->l_max_duty;
	PIDIqHandle_M1.hLowerOutputLimit	  = -PIDIqHandle_M1.hUpperOutputLimit;
	PIDIqHandle_M1.wUpperIntegralLimit    = (int32_t)PIDIqHandle_M1.hUpperOutputLimit * TF_KIDIV,
	PIDIqHandle_M1.wLowerIntegralLimit    = (int32_t)-PIDIqHandle_M1.hUpperOutputLimit * TF_KIDIV,
	FOCVars[M1].min_duty				  = INT16_MAX *mcconf->l_min_duty;


	PIDIdHandle_M1.hKpGain             	  = PIDIqHandle_M1.hKpGain; //Torque and flux has the same P gain
	PIDIdHandle_M1.hKiGain                = PIDIqHandle_M1.hDefKiGain; //Torque and flux has the same I gain
	PIDIdHandle_M1.hDefKpGain 			  = PIDIdHandle_M1.hKpGain;
	PIDIdHandle_M1.hDefKiGain 			  = PIDIdHandle_M1.hKiGain;
	PIDIdHandle_M1.hUpperOutputLimit	  = INT16_MAX * mcconf->l_max_duty;
	PIDIdHandle_M1.hLowerOutputLimit	  = -PIDIdHandle_M1.hUpperOutputLimit;
	PIDIdHandle_M1.wUpperIntegralLimit    = (int32_t)PIDIdHandle_M1.hUpperOutputLimit * TF_KIDIV,
	PIDIdHandle_M1.wLowerIntegralLimit    = (int32_t)-PIDIdHandle_M1.hUpperOutputLimit * TF_KIDIV,

	FW_M1.wNominalSqCurr 				  = current_max * current_max;
	FW_M1.hFW_V_Ref						  = 1000.0 * mcconf->foc_fw_duty_start;
	FW_M1.hDemagCurrent					  = -(mcconf->foc_fw_current_max * CURRENT_FACTOR_A);
	FW_M1.fw_q_current_factor			  = mcconf->foc_fw_q_current_factor * INT16_MAX;
	PIDFluxWeakeningHandle_M1.wLowerIntegralLimit = (int32_t)FW_M1.hDemagCurrent * (int32_t)FW_KIDIV;

	SpeednTorqCtrlM1.MaxAppPositiveMecSpeedUnit = VescToSTM_erpm_to_speed(mcconf->l_max_erpm * 1.15);
	SpeednTorqCtrlM1.MinAppNegativeMecSpeedUnit = VescToSTM_erpm_to_speed(mcconf->l_min_erpm * 1.15);
	SpeednTorqCtrlM1.MaxPositiveTorque			= current_max;
	SpeednTorqCtrlM1.MinNegativeTorque 			= current_min;

	HALL_M1._Super.hMaxReliableMecSpeedUnit     = max_app_speed;
	HALL_M1._Super.hMinReliableMecSpeedUnit     = VescToSTM_erpm_to_speed(mcconf->foc_hall_interp_erpm);
	HALL_M1._Super.bMaximumSpeedErrorsNumber    = MEAS_ERRORS_BEFORE_FAULTS;

	for(int i=0;i<8;i++){
		HALL_M1.lut[i] = mcconf->foc_hall_table[i];
	}
	HALL_M1.SwitchSpeed = VescToSTM_erpm_to_speed(mcconf->foc_hall_interp_erpm);

	VescToSTM_set_temp_cut(mcconf->l_temp_fet_start, mcconf->l_temp_fet_end);

	TempSensorParamsM1.hSensitivity            = (uint16_t)(ADC_REFERENCE_VOLTAGE/dV_dT);
	TempSensorParamsM1.wV0                     = (uint16_t)(V0_V *65536/ ADC_REFERENCE_VOLTAGE);
	TempSensorParamsM1.hT0                     = T0_C;

	float temp = mcconf->l_min_vin * BATTERY_VOLTAGE_GAIN;
	utils_truncate_number(&temp, 0, UINT16_MAX);
	RealBusVoltageSensorParamsM1.UnderVoltageThreshold = mcconf->l_min_vin * BATTERY_VOLTAGE_GAIN;
	temp = mcconf->l_max_vin * BATTERY_VOLTAGE_GAIN;
	utils_truncate_number(&temp, 0, UINT16_MAX);
	RealBusVoltageSensorParamsM1.OverVoltageThreshold = mcconf->l_max_vin * BATTERY_VOLTAGE_GAIN;
	VescToSTM_set_battery_cut(mcconf->l_battery_cut_start, mcconf->l_battery_cut_end);

	// BLDC switching and drive
	mcconf->motor_type = MOTOR_TYPE_FOC;
	mcconf->sensor_mode = SENSOR_MODE_SENSORED;
	mcconf->pwm_mode = PWM_MODE_SYNCHRONOUS;
	mcconf->foc_sensor_mode = FOC_SENSOR_MODE_HALL;

	HALL_Init(&HALL_M1);

	VescToSTM_init_odometer(mcconf);

#if FEED_FORWARD_ENABLED
	/* ---- Feed-forward constants, derived from mc_conf at every config load ----
	 *
	 * FF_VqdffComputation() (feed_forward_ctrl.o, MCSDK 5.4.8) computes, with
	 * w = hSpeed_dpp and Vb = AvBusVoltage_d / 2:
	 *
	 *   Vqdff.q += 16*(C2*w)/Vb + 2*(((w*Iqdref.d)/32768)*C1D)/Vb
	 *   Vqdff.d -=                2*(((w*Iqdref.q)/32768)*C1Q)/Vb
	 *
	 * which must equal the PMSM decoupling  Vq += we*Ld*Id + we*lambda,
	 * Vd -= we*Lq*Iq. Unit chain:
	 *
	 *   w   = we * 65536 / (2*pi*f_foc)          f_foc = TF_REGULATION_RATE [Hz]
	 *   Id  = I[A] * CURRENT_FACTOR_A            s16 current digits per amp
	 *   Vb  = Vbus[V] * BATTERY_VOLTAGE_GAIN / 2 raw ADC digits, halved in the SDK
	 *   V   = 65536 * Vphase / Vbus              s16 voltage, +-32767 <-> +-Vbus/2
	 *
	 * we and Vbus cancel on both axes, leaving
	 *
	 *   C1D = C1Q = 65536 * L      * pi*f_foc*G / (4*CF)
	 *   C2        = 65536 * lambda * pi*f_foc*G / (16*65536)
	 *
	 * The 65536 voltage scale is not documented by ST; it was solved from five
	 * MC Workbench reference projects, which agree on it to within 0.6%, and the
	 * K-independent ratio C2/C1D = lambda*CF/(262144*L) reproduces four of them
	 * to five significant figures. See docs/CHANGES.md.
	 *
	 * Ld = Lq: foc_motor_ld_lq_diff is not populated here and this motor has no
	 * saliency, which is also why the Workbench emits C1D == C1Q. */
	#define FF_C1_COEFF (FF_VOLTAGE_SCALE * 16384.0f * 3.14159265f * (float)TF_REGULATION_RATE * \
	                     (float)BATTERY_VOLTAGE_GAIN / (float)CURRENT_FACTOR_A)
	#define FF_C2_COEFF (FF_VOLTAGE_SCALE * 3.14159265f * (float)TF_REGULATION_RATE * \
	                     (float)BATTERY_VOLTAGE_GAIN / 16.0f)

	/* FF_Init() copies wDefConstant_* over the live wConstant_*, so it has to run
	 * first; FF_SetFFConstants() then installs the values computed here. It also
	 * stores pBus_Sensor, which FF_VqdffComputation() ignores in favour of the
	 * global pBusSensorM1 (set in MCboot) - passing it anyway keeps the handle
	 * honest for anything that reads it. */
	FF_Init(&FF_M1, &RealBusVoltageSensorParamsM1._Super, &PIDIdHandle_M1, &PIDIqHandle_M1);

	FF_TuningStruct_t ff_const;
	ff_const.wConst_1D = (int32_t)(FF_C1_COEFF * mcconf->foc_motor_l);
	ff_const.wConst_1Q = ff_const.wConst_1D;
	ff_const.wConst_2  = (int32_t)(FF_C2_COEFF * mcconf->foc_motor_flux_linkage);
	FF_SetFFConstants(&FF_M1, ff_const);
#endif

	mc_conf = *mcconf;

