bobecek79/SmartESC_STM32_v2/common_files/src/conf_general.c
	/* Must be last: lo_current_max_scale was forced to 1.0 above, and the copy
	 * into mc_conf has just landed, so this is the point where the live config
	 * is complete. Re-applies the selected drive mode's current cap, which
	 * otherwise stayed at 1.0 until the next mode-button press - meaning any
	 * config write handed back full throttle authority while the display still
	 * read SLOW or DRIVE. Covers every caller: boot (:50), COMM_SET_MCCONF
	 * (VescCommand.c:470) and the detection paths (:524, :549, :564, :578). */
	app_adc_apply_mode_scale();

}

void conf_general_calc_apply_foc_cc_kp_ki_gain(mc_configuration *mcconf, float tc) {
	float r = mcconf->foc_motor_r;
	float l = mcconf->foc_motor_l;
	float lambda = mcconf->foc_motor_flux_linkage;

	float bw = 1.0 / (tc * 1e-6);
	float kp = l * bw;
	float ki = r * bw;
	float gain = 1.0e-3 / (lambda * lambda);

	mcconf->foc_current_kp = kp;
	mcconf->foc_current_ki = ki;
	mcconf->foc_observer_gain = gain * 1e6;
}

/**
 * Detect and apply all parameters, current limits and sensors. This is done for
 * both motors on dual controllers.
 *
 * @param max_power_loss
 * The maximum power loss to derive current limits, as well as detection currents, from.
 *
 * @param store_mcconf_on_success
 * Store motor configuration in emulated EEPROM if the detection succeeds.
 *
 * @param send_mcconf_on_success
 * Send motor configuration if the detection succeeds.
 *
 * @return
 * >=0: Success, see conf_general_autodetect_apply_sensors_foc codes
 * -10: Flux linkage detection failed
 *  -x: see conf_general_autodetect_apply_sensors_foc faults
 */
int conf_general_detect_apply_all_foc(float max_power_loss,	bool store_mcconf_on_success, bool send_mcconf_on_success, PACKET_STATE_t * phandle) {
	int result = -1;

	mc_configuration *mcconf = &mc_conf;
	mc_configuration *mcconf_old = pvPortMalloc(sizeof(mc_configuration));

	*mcconf_old = *mcconf;

	mcconf->motor_type = MOTOR_TYPE_FOC;
	mcconf->foc_sensor_mode = FOC_SENSOR_MODE_HALL;
	mcconf->foc_f_sw = 16000.0;
	/* Deliberately sluggish gains for the measurement routines, expressed in the
	 * loop's own counts domain rather than SI - 0.0005 V/A would be meaningless
	 * for an 80 mOhm motor. FOC_CC_GAIN_SCALE is divided out so that
	 * conf_general_setup_mc() multiplies it back and the detection loop sees the
	 * same gains it saw before that scale existed.
	 *
	 * NOTE: these two assignments are currently INERT. The
	 * conf_general_setup_mc(mcconf) call below is commented out, and neither
	 * tune.c nor anything else pushes mcconf into the PID handles, so detection
	 * actually runs on whatever gains setup_mc() last installed - the stored
	 * foc_current_kp/ki. The scaling is kept anyway so that the values are
	 * correct if that call is ever restored; without it, restoring the call
	 * would hand the detection loop 7.6x the intended gain.
	 *
	 * They never persist either way: mcconf_old is restored before returning. */
	mcconf->foc_current_kp = 0.0005f / FOC_CC_GAIN_SCALE;
	mcconf->foc_current_ki = 1.0f / FOC_CC_GAIN_SCALE;
	mcconf->l_current_max = MCCONF_L_CURRENT_MAX;
	mcconf->l_current_min = MCCONF_L_CURRENT_MIN;
	mcconf->l_current_max_scale = MCCONF_L_CURRENT_MAX_SCALE;
	mcconf->l_current_min_scale = MCCONF_L_CURRENT_MIN_SCALE;
	mcconf->l_watt_max = MCCONF_L_WATT_MAX;
	mcconf->l_watt_min = MCCONF_L_WATT_MIN;
	mcconf->l_max_erpm = MCCONF_L_RPM_MAX;
	mcconf->l_min_erpm = MCCONF_L_RPM_MIN;
	//conf_general_setup_mc(mcconf);


	// Wait one second for things to get ready after
	// the fault disappears.
	vTaskDelay(MS_TO_TICKS(1000));

	// Disable timeout
	VescToSTM_enable_timeout(false);


	float r = 0.0;
	float l = 0.0;
	float i_max = 0.0;
	bool res_r_l_imax_m1 = tune_foc_measure_r_l_imax(mcconf->cc_min_current,
			mcconf->l_current_max, max_power_loss, &r, &l, &i_max);

	if (!res_r_l_imax_m1) {
		conf_general_setup_mc(mcconf_old);
		vPortFree(mcconf_old);
		return -11;
	}

	float lambda = 0.0;
	float lambda_undriven = 0.0;
	float lambda_undriven_samples = 0.0;
	int res = tune_foc_measure_flux_linkage_openloop(i_max / 2.5, 0.3, 1800, r, l,
			&lambda, &lambda_undriven, &lambda_undriven_samples);

	if (lambda_undriven_samples > 60) {
		lambda = lambda_undriven;
	}


	if (res) {
		mcconf_old->l_current_max = i_max;
		mcconf_old->l_current_min = -i_max;
		mcconf_old->motor_type = MOTOR_TYPE_FOC;
		mcconf_old->foc_motor_r = r;
		mcconf_old->foc_motor_l = l;
		mcconf_old->foc_motor_flux_linkage = lambda;
		VescToSTM_stop_motor();
		conf_general_calc_apply_foc_cc_kp_ki_gain(mcconf_old, 1000);
		conf_general_setup_mc(mcconf_old);


		// TODO: optionally apply temperature compensation here.

		vTaskDelay(MS_TO_TICKS(1000));
		//wait_motor_stop(10000);
		VescToSTM_start_motor();

		// This will also store the settings to emulated eeprom and send them to vesc tool

		uint8_t hall_tab[8];
		bool res = tune_mcpwm_foc_hall_detect((i_max / 3.0), hall_tab);
		if(res==true){
			memcpy(mcconf_old->foc_hall_table,hall_tab, 8);
			conf_general_setup_mc(mcconf_old);
			commands_send_mcconf(COMM_GET_MCCONF, mcconf_old, phandle);
			conf_general_store_mc_configuration(mcconf_old, false);
			result = 1;
		}

	} else {
		result = -10;
	}

	VescToSTM_enable_timeout(true);

	*mcconf = *mcconf_old;

	/* The copy above puts lo_current_max_scale back to 1.0 and loses the drive
	 * mode's cap. conf_general_setup_mc() forces that field to 1.0 (see the top
	 * of it), copies the struct into the mc_conf global, and only then restores
	 * the mode scale through app_adc_apply_mode_scale() - which writes the
	 * GLOBAL, not the mcconf_old it was handed. So after the successful-detection
	 * path calls setup_mc(mcconf_old), mcconf_old still carries 1.0, and this
	 * copy writes that straight over the corrected global.
	 *
	 * The failure path below re-runs setup_mc() and recovers on its own, but the
	 * success path had nothing, leaving full current authority in every drive
	 * mode until the next mode-button press while the display still read SLOW or
	 * DRIVE. Re-applied unconditionally here: on the failure path setup_mc() has
	 * already done it and a second call is a no-op, and being unconditional
	 * keeps it correct if these branches are ever rearranged. */
	if (result < 0) {
		conf_general_setup_mc(mcconf);
	}
	app_adc_apply_mode_scale();

	vPortFree(mcconf_old);

	return result;
}

/**
 * Same as conf_general_detect_apply_all_foc, but also start detection in VESCs found on the CAN-bus.
 *
 * @param detect_can
 * Run detection on VESCs found on the CAN-bus as well. Setting this to false makes
 * this function behave like conf_general_detect_apply_all_foc, with the convenience
 * of also applying the settings.
 *
 * @param max_power_loss
 * The maximum power loss to derive current limits, as well as detection currents, from.
 *
 * @param min_current_in
 * Minimum input current (negative value). 0 means leave it unchanged.
 *
 * @param max_current_in
 * MAximum input current. 0 means leave it unchanged.
 *
 * @param openloop_rpm
 * FOC openloop ERPM in sensorless mode. 0 means leave it unchanged.
 *
 * @param sl_erpm
 * FOC ERPM above which sensorless should be used in sensored modes. 0 means leave it unchanged.
 *
 * @return
 * Same as conf_general_detect_apply_all_foc, and
 * -50: CAN detection timed out
 * -51: CAN detection failed
 */
int conf_general_detect_apply_all_foc_can(bool detect_can, float max_power_loss,
		float min_current_in, float max_current_in, float openloop_rpm, float sl_erpm, PACKET_STATE_t * phandle) {


	int res = conf_general_detect_apply_all_foc(max_power_loss, false, false, phandle);

	return res;
}
